# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

## ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'

## GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

## GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

## Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'mackup'
brew 'trash'
brew 'wget'
brew 'openssl'
brew 'gs'
brew 'pkg-config'
brew 'ag'
brew 'lsd'

## Development
brew 'node'
brew 'rbenv'
brew 'ruby-build'
brew 'pv'
brew 'qt5', link: true
brew 'mysql@5.7', restart_service: true, link: true, conflicts_with: ['mysql']
brew 'imagemagick@6', link: true
brew 'postgresql'
brew 'redis'
brew 'autojump'
brew 'exercism'
brew 's3cmd'
brew 'openshift-cli'
brew 'htop'
brew 'elm'
brew 'heroku/brew/heroku'


# Apps

## Media
cask 'vlc'
cask 'quik'
cask 'spotify'

## Tools
cask 'alfred'
cask 'iterm2'
cask 'shuttle'
cask 'istat-menus'
cask 'libreoffice'
cask 'flux'

## Internet
cask 'firefox'
cask 'google-chrome'
cask 'transmit'
cask 'slack'
cask 'skype'
cask 'blue-jeans'
cask 'telegram'

## Security
cask 'gpg-suite'
cask 'viscosity'
cask 'tunnelblick'
cask 'encryptr'
cask 'spideroakone'
cask 'keybase'

## Development
cask 'docker'
cask 'atom'
cask 'rubymine'
cask 'sequel-pro'
cask 'psequel'
cask 'dash'

## Misc
cask 'aerial'
cask 'spectacle'

## Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

## Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
