# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

## ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'

## GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

## GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

## Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'mackup'
brew 'trash'
brew 'wget'
brew 'openssl'
brew 'gs'
brew 'pkg-config'
brew 'ag'
brew 'lsd'

## Development
brew 'go'
brew 'node'
brew 'pv'
#brew 'qt5', link: true
brew 'postgresql'
brew 'redis'
brew 'autojump'
brew 'exercism'
brew 's3cmd'
brew 'kubectl'
brew 'openshift-cli'
brew 'htop'
brew 'jq'
brew 'yq'


# Apps

## Media
cask 'vlc'
cask 'spotify'

## Tools
cask 'alfred'
cask 'iterm2'
cask 'shuttle'
cask 'istat-menus'
cask 'libreoffice'

## Internet
cask 'firefox'
cask 'brave-browser'
cask 'transmit'
cask 'slack'
cask 'telegram'
cask 'signal'

## Security
cask 'gpg-suite'
cask 'viscosity'
cask 'tunnelblick'
cask 'bitwarden'
cask 'spideroakone'
cask 'nordvpn'
cask 'mullvadvpn'
cask 'micro-snitch'
cask 'little-snitch'

## Development
cask 'docker'
cask 'goland'
cask 'sequel-pro'

## Misc
cask 'aerial'
cask 'spectacle'

## Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
