# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

## ZSH
brew 'zsh'
brew 'zsh-completions'

## GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

## GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

## Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'mackup'
brew 'trash'
brew 'wget'
brew 'openssl'

## Development
brew 'node'
brew 'rbenv'
brew 'ruby-build'
brew 'yarn'
brew 'mysql'
brew 'postgresql'
brew 'redis'
brew 'heroku-toolbelt'
brew 'autojump'
brew 'exercism'
brew 's3cmd'
brew 'openshift-cli'
brew 'htop'
brew 'sphinx'
brew 'dnsmasq'


# Apps

## Media
cask 'vlc'
cask 'quik'
cask 'spotify'
cask 'sonos'

## Tools
cask 'alfred'
cask 'iterm2'
cask 'shuttle'
cask 'istat-menus'
cask 'licecap'
cask 'libreoffice'
cask 'flux'

## Internet
cask 'firefox'
cask 'google-chrome'
cask 'transmit'
cask 'slack'
cask 'skype'

## Security
cask 'gpgtools'
cask 'viscosity'
cask 'tunnelblick'
cask 'encryptr'
cask 'spideroakone'

## Development
cask 'docker'
cask 'atom'
cask 'rubymine'
cask 'android-file-transfer'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'sequel-pro'
cask 'psequel'
cask 'vagrant'
cask 'dash'
cask 'virtualbox'

## Misc
cask 'aerial'
cask 'ehon'
cask 'spectacle'

## Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

## Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'


# Mac App Store apps
mas 'Xcode', id: 497799835
mas 'Telegram', id: 747648890
mas 'Deckset', id: 847496013
mas 'Sketch', id: 402476602
mas 'Twitter', id: 409789998
